//******************************************************************************
// [File] XCradleDebuglevel.uni
// [Description] Define XCradle Debug level String
// [Author] Devin Diao
// [Date] 20230610
//******************************************************************************

#include "VFR.uni"
#langdef   x-AMI "x-AMI"      // AMI Configuration Language

#string STR_SYS_DEBUG_FORM_TITLE                  #language eng "System Debug Configuration"
                                                  #language zh-chs "系统调试设置"
#string STR_SYS_DEBUG_FORM_HELP                   #language eng "Detail for System Debug Configuration"
                                                  #language zh-chs "系统调试设置"

#string STR_SYS_DEBUG_LEVEL_PROMPT                #language eng "System Debug Level"
                                                  #language zh-chs "系统调试等级"
                                                  #language x-AMI "SystemDebugLevel"
#string STR_SYS_DEBUG_LEVEL_HELP                  #language eng "System Debug Level Option Setting. \nDisabled: No system debug message; Minimum: Only key message; Normal: normal debug message; Maximum: More MRC and RAS debug message than Normal.\n"
                                                                "Note: The higher the debug level, the longer the boot time.\n"
                                                  #language zh-chs "系统调试等级设置. \n关闭：没有系统调试信息；最小调试：只有关键信息；一般调试：正常的调试信息； 最大调试：MRC和RAS调试信息比一般调试更多.\n"
                                                                   "注意：调试等级越高，开机时间越长\n"

#string STR_DEBUG                                 #language eng "Debug"
                                                  #language zh-chs "调试"
#string STR_DEBUG_MINIMUM                         #language en-US "Minimum"
                                                  #language zh-chs "最小调试"
#string STR_DEBUG_NORMAL                          #language en-US "Normal"
                                                  #language zh-chs "一般调试"
#string STR_DEBUG_MAXIMUM                         #language en-US "Maximum"
                                                  #language zh-chs "最大调试"
